#### HardwoodFinishType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "HardwoodFinish" from the "Hardwood" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum HardwoodFinishType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration HardwoodFinishType ``` |

| Visual C++ |
| --- |
| ``` public enum class HardwoodFinishType ``` |

# Members

| Member name | Description |
| --- | --- |
| Gloss |  |
| Semigloss |  |
| Satin |  |
| Unfinished |  |

# See Also

Autodesk.Revit.DB.Visual Namespace